{"format": "layers-model", "generatedBy": "keras v2.6.0", "convertedBy": "TensorFlow.js Converter v3.8.0", "modelTopology": {"keras_version": "2.6.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 150, 150, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "batch_input_shape": [null, 150, 150, 1], "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [1, 1], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0020000000949949026, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of82.bin", "group1-shard2of82.bin", "group1-shard3of82.bin", "group1-shard4of82.bin", "group1-shard5of82.bin", "group1-shard6of82.bin", "group1-shard7of82.bin", "group1-shard8of82.bin", "group1-shard9of82.bin", "group1-shard10of82.bin", "group1-shard11of82.bin", "group1-shard12of82.bin", "group1-shard13of82.bin", "group1-shard14of82.bin", "group1-shard15of82.bin", "group1-shard16of82.bin", "group1-shard17of82.bin", "group1-shard18of82.bin", "group1-shard19of82.bin", "group1-shard20of82.bin", "group1-shard21of82.bin", "group1-shard22of82.bin", "group1-shard23of82.bin", "group1-shard24of82.bin", "group1-shard25of82.bin", "group1-shard26of82.bin", "group1-shard27of82.bin", "group1-shard28of82.bin", "group1-shard29of82.bin", "group1-shard30of82.bin", "group1-shard31of82.bin", "group1-shard32of82.bin", "group1-shard33of82.bin", "group1-shard34of82.bin", "group1-shard35of82.bin", "group1-shard36of82.bin", "group1-shard37of82.bin", "group1-shard38of82.bin", "group1-shard39of82.bin", "group1-shard40of82.bin", "group1-shard41of82.bin", "group1-shard42of82.bin", "group1-shard43of82.bin", "group1-shard44of82.bin", "group1-shard45of82.bin", "group1-shard46of82.bin", "group1-shard47of82.bin", "group1-shard48of82.bin", "group1-shard49of82.bin", "group1-shard50of82.bin", "group1-shard51of82.bin", "group1-shard52of82.bin", "group1-shard53of82.bin", "group1-shard54of82.bin", "group1-shard55of82.bin", "group1-shard56of82.bin", "group1-shard57of82.bin", "group1-shard58of82.bin", "group1-shard59of82.bin", "group1-shard60of82.bin", "group1-shard61of82.bin", "group1-shard62of82.bin", "group1-shard63of82.bin", "group1-shard64of82.bin", "group1-shard65of82.bin", "group1-shard66of82.bin", "group1-shard67of82.bin", "group1-shard68of82.bin", "group1-shard69of82.bin", "group1-shard70of82.bin", "group1-shard71of82.bin", "group1-shard72of82.bin", "group1-shard73of82.bin", "group1-shard74of82.bin", "group1-shard75of82.bin", "group1-shard76of82.bin", "group1-shard77of82.bin", "group1-shard78of82.bin", "group1-shard79of82.bin", "group1-shard80of82.bin", "group1-shard81of82.bin", "group1-shard82of82.bin"], "weights": [{"name": "conv2d/kernel", "shape": [5, 5, 1, 64], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [5, 5, 64, 64], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [5, 5, 64, 128], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [128], "dtype": "float32"}, {"name": "dense/kernel", "shape": [165888, 512], "dtype": "float32"}, {"name": "dense/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [1024, 4], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [4], "dtype": "float32"}]}]}